@nodecaf and @nicholas-cross-fujitsu - the following working example demonstrates the deployment of the ESXi 7.0u3 OVA from both local path and remote URL in a single plan using the `latest` (v2.0.2) for the provider and `latest` for Terraform (v1.0.10) as os this posting date.

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
  }
  required_version = ">= 1.0.10"
}

provider "vsphere" {
  user                 = "administrator@vsphere.local"
  password             = "VMware1!"
  vsphere_server       = "m01-vc01.rainpole.io"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "datacenter" {
  name = "m01-dc01"
}

data "vsphere_datastore" "datastore" {
  name          = "local-ssd-02"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "default" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_host" "host" {
  name          = "m01-esx01.rainpole.io"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_network" "network" {
  name          = "M - 172.16.11.0"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_folder" "folder" {
  path = "/${data.vsphere_datacenter.datacenter.name}/vm"
}

## Remote OVF/OVA Source
data "vsphere_ovf_vm_template" "ovfRemote" {
  name              = "foo"
  disk_provisioning = "thin"
  resource_pool_id  = data.vsphere_resource_pool.default.id
  datastore_id      = data.vsphere_datastore.datastore.id
  host_system_id    = data.vsphere_host.host.id
  remote_ovf_url    = "https://download3.vmware.com/software/vmw-tools/nested-esxi/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
  ovf_network_map = {
    "VM Network" : data.vsphere_network.network.id
  }
}

## Local OVF/OVA Source
data "vsphere_ovf_vm_template" "ovfLocal" {
  name              = "foo"
  disk_provisioning = "thin"
  resource_pool_id  = data.vsphere_resource_pool.default.id
  datastore_id      = data.vsphere_datastore.datastore.id
  host_system_id    = data.vsphere_host.host.id
  local_ovf_path    = "/Users/johnsonryan/Downloads/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
  ovf_network_map = {
    "VM Network" : data.vsphere_network.network.id
  }
}

## Deployment of VM from Remote OVF
resource "vsphere_virtual_machine" "vmFromRemoteOvf" {
  name                 = "Nested-ESXi-7.0-Remote"
  folder               = trimprefix(data.vsphere_folder.folder.path, "/${data.vsphere_datacenter.datacenter.name}/vm")
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  datastore_id         = data.vsphere_datastore.datastore.id
  host_system_id       = data.vsphere_host.host.id
  resource_pool_id     = data.vsphere_resource_pool.default.id
  num_cpus             = data.vsphere_ovf_vm_template.ovfLocal.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovfLocal.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovfLocal.memory
  guest_id             = data.vsphere_ovf_vm_template.ovfLocal.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovfLocal.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovfLocal.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

  ovf_deploy {
    allow_unverified_ssl_cert = false
    local_ovf_path            = data.vsphere_ovf_vm_template.ovfLocal.local_ovf_path
    disk_provisioning         = data.vsphere_ovf_vm_template.ovfLocal.disk_provisioning
    ovf_network_map           = data.vsphere_ovf_vm_template.ovfLocal.ovf_network_map
  }

  vapp {
    properties = {
      "guestinfo.hostname"  = "nested-esxi-01.rainpole.io",
      "guestinfo.ipaddress" = "172.16.11.101",
      "guestinfo.netmask"   = "255.255.255.0",
      "guestinfo.gateway"   = "172.16.11.1",
      "guestinfo.dns"       = "172.16.11.4",
      "guestinfo.domain"    = "rainpole.io",
      "guestinfo.ntp"       = "ntp.rainpole.io",
      "guestinfo.password"  = "VMware1!",
      "guestinfo.ssh"       = "True"
    }
  }

  lifecycle {
    ignore_changes = [
      annotation,
      disk[0].io_share_count,
      disk[1].io_share_count,
      disk[2].io_share_count,
      vapp[0].properties,
    ]
  }
}

## Deployment of VM from Local OVF
resource "vsphere_virtual_machine" "vmFromLocalOvf" {
  name                 = "Nested-ESXi-7.0-Local"
  folder               = trimprefix(data.vsphere_folder.folder.path, "/${data.vsphere_datacenter.datacenter.name}/vm")
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  datastore_id         = data.vsphere_datastore.datastore.id
  host_system_id       = data.vsphere_host.host.id
  resource_pool_id     = data.vsphere_resource_pool.default.id
  num_cpus             = data.vsphere_ovf_vm_template.ovfLocal.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovfLocal.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovfLocal.memory
  guest_id             = data.vsphere_ovf_vm_template.ovfLocal.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovfLocal.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovfLocal.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

  ovf_deploy {
    allow_unverified_ssl_cert = true
    local_ovf_path            = data.vsphere_ovf_vm_template.ovfLocal.local_ovf_path
    disk_provisioning         = data.vsphere_ovf_vm_template.ovfLocal.disk_provisioning
    ovf_network_map           = data.vsphere_ovf_vm_template.ovfLocal.ovf_network_map
  }

  vapp {
    properties = {
      "guestinfo.hostname"  = "nested-esxi-02.rainpole.io",
      "guestinfo.ipaddress" = "172.16.11.102",
      "guestinfo.netmask"   = "255.255.255.0",
      "guestinfo.gateway"   = "172.16.11.1",
      "guestinfo.dns"       = "172.16.11.4",
      "guestinfo.domain"    = "rainpole.io",
      "guestinfo.ntp"       = "ntp.rainpole.io",
      "guestinfo.password"  = "VMware1!",
      "guestinfo.ssh"       = "True"
    }
  }

  lifecycle {
    ignore_changes = [
      annotation,
      disk[0].io_share_count,
      disk[1].io_share_count,
      disk[2].io_share_count,
      vapp[0].properties,
    ]
  }
}
```

Results:

```bash
> terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vmFromLocalOvf will be created
  + resource "vsphere_virtual_machine" "vmFromLocalOvf" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-13"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "vmkernel65Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "Nested-ESXi-7.0-Local"
      + nested_hv_enabled                       = true
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = false
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + local_ovf_path            = "/Users/johnsonryan/Downloads/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
          + ovf_network_map           = {
              + "VM Network" = "network-1001"
            }
        }

      + vapp {
          + properties = {
              + "guestinfo.dns"       = "172.16.11.4"
              + "guestinfo.domain"    = "rainpole.io"
              + "guestinfo.gateway"   = "172.16.11.1"
              + "guestinfo.hostname"  = "nested-esxi-02.rainpole.io"
              + "guestinfo.ipaddress" = "172.16.11.102"
              + "guestinfo.netmask"   = "255.255.255.0"
              + "guestinfo.ntp"       = "ntp.rainpole.io"
              + "guestinfo.password"  = "VMware1!"
              + "guestinfo.ssh"       = "True"
            }
        }
    }

  # vsphere_virtual_machine.vmFromRemoteOvf will be created
  + resource "vsphere_virtual_machine" "vmFromRemoteOvf" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-13"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "vmkernel65Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "Nested-ESXi-7.0-Remote"
      + nested_hv_enabled                       = true
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = false
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + local_ovf_path            = "/Users/johnsonryan/Downloads/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
          + ovf_network_map           = {
              + "VM Network" = "network-1001"
            }
        }

      + vapp {
          + properties = {
              + "guestinfo.dns"       = "172.16.11.4"
              + "guestinfo.domain"    = "rainpole.io"
              + "guestinfo.gateway"   = "172.16.11.1"
              + "guestinfo.hostname"  = "nested-esxi-01.rainpole.io"
              + "guestinfo.ipaddress" = "172.16.11.101"
              + "guestinfo.netmask"   = "255.255.255.0"
              + "guestinfo.ntp"       = "ntp.rainpole.io"
              + "guestinfo.password"  = "VMware1!"
              + "guestinfo.ssh"       = "True"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vmFromLocalOvf: Creating...
vsphere_virtual_machine.vmFromRemoteOvf: Creating...
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [1m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [1m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [2m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [2m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [3m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [3m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [4m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [4m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [5m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [5m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [6m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [6m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [7m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [7m50s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m20s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m30s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m40s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [8m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [8m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m0s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m10s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m10s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m20s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m30s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m40s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [9m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [9m50s elapsed]
vsphere_virtual_machine.vmFromLocalOvf: Still creating... [10m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Still creating... [10m0s elapsed]
vsphere_virtual_machine.vmFromRemoteOvf: Creation complete after 10m5s [id=4202ea28-701d-33d1-436b-50e83b8f3c4d]
vsphere_virtual_machine.vmFromLocalOvf: Creation complete after 10m9s [id=420232df-604b-0a33-05d7-d3fa4b929fd8]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

Hope this helps,
Ryan
@tenthirtyam

Recommend:  `close/not-a-bug` (with `latest`)